Revit 2027 API
RebarBarType.BarModelDiameter Property
 Defines bar model diameter of rebar
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double BarModelDiameter { get; set; }
Public Property BarModelDiameter As Double
	Get
	Set
public:
property double BarModelDiameter {
	double get ();
	void set (double value);
}
member BarModelDiameter : float with get, set
Property Value
Double
 The bar model diameter of rebar
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: the bar diameter barModelDiam is not positive or bigger than the smallest value of 1.0, and current internal values of standard bend diameter, standard hook bend diameter and stirrup/tie bend diameter
See Also
Reference
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace